
## Plan Result

[CI link](https://github.com/Digix00/hackathon/actions/runs/23262046631)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_scheduler_job.worker_kick
* Update
  * google_cloud_run_v2_service.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
        id                      = "projects/musicswapping/locations/asia-northeast1/services/api"
        name                    = "api"
        # (33 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_scheduler_job.worker_kick will be created
  + resource "google_cloud_scheduler_job" "worker_kick" {
      + id        = (known after apply)
      + name      = "worker-kick"
      + paused    = (known after apply)
      + project   = "musicswapping"
      + region    = "asia-northeast1"
      + schedule  = "*/10 * * * *"
      + state     = (known after apply)
      + time_zone = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/musicswapping/locations/asia-northeast1/jobs/worker:run"

          + oauth_token {
              + service_account_email = "scheduler-sa@musicswapping.iam.gserviceaccount.com"
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":109,"Program":"tfcmt","SHA1":"110f965680eec17368052a6ed60ed9d0583684d8","Vars":{},"WorkflowName":"terraform-plan"} -->